// ====== data_cards.js ======
// 存放游戏的所有基础与特殊攻击卡牌

const rawCards = {
    "cardA1": ["低位魔法", 0, 2, "魔法"], "cardA2": ["中位魔法", 0, 3, "魔法"], "cardA3": ["高位魔法", 0, 4, "魔法"], "cardA4": ["高位魔法", 1, 5, "魔法"], "cardA5": ["狂战士魔法1", 3, 7, "魔法"], "cardA6": ["狂战士魔法2", 5, 9, "魔法"],
    "cardB1": ["迫击", 0, 2, "力量"], "cardB2": ["强打", 0, 3, "力量"], "cardB3": ["浑身的一击", 0, 4, "力量"], "cardB4": ["会心的一击", 1, 5, "力量"], "cardB5": ["狂战士力量1", 3, 7, "力量"], "cardB6": ["狂战士力量2", 5, 9, "力量"],
    "cardQ1": ["翻弄", 0, 2, "迅捷"], "cardQ2": ["瞬间移动", 0, 3, "迅捷"], "cardQ3": ["瞬间的一击", 0, 4, "迅捷"], "cardQ4": ["刹那的一击", 1, 5, "迅捷"], 
    "cardQ5": ["狂战士迅捷1", 3, 7, "迅捷"], "cardQ6": ["狂战士迅捷2", 5, 9, "迅捷"],
    "cardluck": ["幸运", 0, 4, "特殊", "战斗阶段：你本回合无视直接败北效果。"],
    "cardPreparation": ["远隔操作", 1, 2, "特殊", "行动：地利翻倍。战斗：若赢，获2战果。"],
    "cardSurveil": ["急行", 1, 3, "特殊", "行动：无视交战沿箭头移动。"],
    "Card_YinQi": ["阴炁弹", 0, 1, "魔术", "0耗1威,<每局一次>"],
    "Card_Snake": ["蛇", 0, 5, "力量/迅捷", "0耗5威"],
    "Card_Origin": ["起源弹", 0, 2, "迅捷", "切断与结合-战斗阶段：令一名你的交战对手失去三分之一的魔力（向上取整），然后此牌获得等同于其失去魔力值二倍的威力。"],
    "Card_Avenger": ["复仇者", 1, 0, "特殊", "战斗阶段：你的其余攻击威力+1。\n无声业火—残留：此牌残留至你在场战斗中战胜了一名对手为止。"],
    "Card_Volumen_Track": ["月灵髓液", 0, 1, "魔术", "被动可花2魔追加。战斗：对手失地利。"],
    "Card_Volumen_Slash": ["月灵髓液", 0, 2, "魔术/迅捷", "被动可花2魔追加。行动：威力+2。"],
    "Card_Volumen_Boil": ["月灵髓液", 0, 0, "特殊", "被动可花2魔追加。战斗：无视败北。"],
    "Card_Cover": ["援护射击", 2, 0, "迅捷", "追加打出。压制-非舞弥需支2战果，获+1基础地利后翻倍地利。"],
    // 远野志贵【退魔者】牌库替换牌（游戏外各3张）
    "Card_Flash_Blade": ["闪鞘", 0, 5, "迅捷", "杀戮冲动-唯一/被动：当一名你本回合以【直死之魔眼】捕捉的玩家进入你所在的地点时，打出此牌。\n十六分割-战斗阶段：受到1点【损伤】，然后你猜测一名你交战对手牌库顶牌的威力并展示。若你猜对，令其【败北】。"],
    "Card_Flash_Step": ["闪走", 0, 3, "特殊", "蜘蛛步-被动：当你于你的回合进行移动后，你可以从手牌打出此牌。\n水月-战斗阶段：展示手牌中的一张特殊牌并移动至另一处你本回合曾位于的地点。若如此做，你+3合计威力。"],
    // 琥珀【笑面琥】加入牌库的牌
    "Card_Kohaku_Blast": ["魔力猛攻", 0, 0, "力量", "真言术：燃-战斗阶段：令你的所有交战对手计算合计威力时改为减少其地利数而不是增加。若你不位于战场，改为选择一名不位于魔术工房的对手【烧毁工房】。"],
    // 戈尔德鲁夫【铁腕绅士】牌库替换牌
    "Card_Gof_Fist": ["戈夫铁拳", 0, 2, "力量", "裸拳警告！-唯一/战斗阶段：若你赢得战斗，获得4点战果。\n双拳出击！-战斗阶段：弃置一张【戈夫铁拳】，此牌威力翻倍。"]
};

for (let k in rawCards) {
    DB.cards[k] = { id: k, name: rawCards[k][0], cost: rawCards[k][1], power: rawCards[k][2], type: rawCards[k][3], desc: rawCards[k][4] || "基础攻击卡牌" };
}